package com.qquhuan.regex;

public class ReplaceAllTest {
    public static void main(String[] args) {
        String s = "先帝1创业2未半而中道3崩殂4，今5天下三分6，益州疲弊7，此8诚危急存亡之秋也。然9侍卫之臣不懈于内，忠志之士忘身10于外者，盖追先帝之殊遇11，欲报之于陛下也。诚宜12开张圣听13，以光14先帝遗德，恢弘15志士之气，不宜妄自菲薄16，引喻失义17，以塞忠谏之路也18。\n" +
                "宫中府中，俱为一体19；陟罚臧否20，不宜异同：若有作奸犯科21及为忠善者22，宜付有司23论其刑赏24，以昭陛下平明之理25；不宜偏私26，使内外异法也27。\n" +
                "侍中、侍郎郭攸之、费祎、董允等，此皆良实，志虑忠纯28，是以先帝简拔以遗陛下29：愚以为宫中之事，事无大小，悉以咨之30，然后施行，必能裨补阙漏31，有所广益32。\n" +
                "将军向宠，性行淑均33，晓畅34军事，试用35于昔日，先帝称之曰“能”，是以众议举宠为督36：愚以为营37中之事，悉以咨之，必能使行阵38和睦，优劣得所39。\n" +
                "亲贤臣，远小人40，此先汉所以兴隆也；亲小人，远贤臣，此后汉所以倾颓41";
        String x = s.replaceAll("\\d", "");
        System.out.println(x);
        System.out.println(s);
    }
}
